app/controllers/static_ips_controller.rb

SELECT * FROM `subnets` WHERE (`subnets`.`id` IN (1,2))
SELECT * FROM `static_ips` WHERE (`static_ips`.subnet_id = 2)
---
  def index
    @subnet = Subnet.find(params[:subnet_id])
    @static_ips = @subnet.static_ips.find(:all)

SELECT * FROM `static_ips` WHERE (`static_ips`.`id` = 1)
---
  def show
    @static_ip = StaticIp.find(:all)

SELECT * FROM `subnets` WHERE (`subnets`.`id` = 1)
SELECT * FROM `static_ips` WHERE (`static_ips`.`id` = 6 AND (`static_ips`.subnet_id = 1))
---
  def edit
    @subnet = Subnet.find(params[:subnet_id])
    @static_ip = @subnet.static_ips.find(params[:id])

SELECT * FROM `subnets` WHERE (`subnets`.`id` = 1)
SELECT * FROM `static_ips` WHERE (`static_ips`.`id` = 1 AND (`static_ips`.subnet_id = 1))
UPDATE `static_ips` SET `servername` = 'test', `available` = 1, `description` = 'this is a test', `outside_ip` = '0.0.0.0', `updated_at` = '2009-03-19 18:33:15' WHERE `id` = 1
---
  def update
    @subnet = Subnet.find(params[:subnet_id])
    @static_ip = @subnet.static_ips.find(params[:id])

    respond_to do |format|
      if @static_ip.update_attributes(params[:static_ip])

SELECT * FROM `static_ips` WHERE (`static_ips`.`id` = 4)
DELETE FROM `static_ips` WHERE `id` = 4
---
  def destroy
    @static_ip = StaticIp.find(params[:id])
    @static_ip.destroy

SELECT * FROM `subnets` WHERE (`subnets`.`id` = 1)
SELECT * FROM `static_ips` WHERE (`static_ips`.`available` = 0) LIMIT 1
---
  def available
    @subnet = Subnet.find(params[:subnet_id])
    @static_ips = StaticIp.find(:all, :conditions => {:available => false})

SELECT * FROM `subnets` WHERE (`subnets`.`id` = 1)
SELECT * FROM "static_ips" WHERE ("static_ips"."available" = 't')
---
  def unavailable
    @subnet = Subnet.find(params[:subnet_id])
    @static_ips = StaticIp.find(:all, :conditions => {:available => true })