app/controllers/subnets_controller.rb

  def show
    @subnet = Subnet.find(params[:id])
---
SELECT * FROM `subnets` WHERE (`subnets`.`id` = 1)

  def edit
    @subnet = Subnet.find(params[:id])
---
SELECT * FROM `subnets` WHERE (`subnets`.`id` = 1)

  def create
    @subnet = Subnet.new(params[:subnet])

    respond_to do |format|
      if @subnet.save
---
INSERT INTO `subnets` (`updated_at`, `network`, `network_name`, `created_at`) VALUES('2009-03-18 22:19:40', '10.0.160.0', 'Servers', '2009-03-18 22:19:40')